{
    "tittle": "Wonderful",
    "date": "September 1, 2013",
    "memoryVerse": "Who is like unto thee, O LORD, among the gods? who is like thee, glorious in holiness, fearful in praises, doing wonders",
    "verse": "Exodus 15:11",
    "biblePassage": "JOHN 11:39-45",
    "outline": [
        "what are the wonderful attributes of of jesus christ?",
        "how do you partake of his wonders?"
    ],
    "content": [
        [
            "Jesus Christ is the custodian of wonders, both pleasant and unpleasant. In the episode of the crossing of the Red Sea in Exodus 14:21-30, He revealed Himself in both to the Israelites and the Egyptians as one full of wonders.",
            "His name is wonderful - Philippians 2:9-11. His name guarantees answer to prayers.",
            "His love is wonderful - John 3:16, John 15:13.",
            "His peace is wonderful - Philippians 4:7. His peaces passes all understanding - John 14:27.",
            "His power is wonderful - Matthew 28:18, Matthew 8:14-15, Mark 1:23-26.",
            "His works are wonderful - Psalm 111:4.",
            "He is a wonderful friend - John 15:13. He is a wonderful partner. A reliable and best busisness partner. Luke 5:1-7.",
            "he is a wonderful physician. He heals and brings back to life - Johm 11:40-45. When He recreates, this is termed wonderful."
        ],
        [
            "Be born again - John 3:3, Hebrews 12:14.",
            "Confess Jesus Christ as Lord and Saviour - Matthew 10:32-34.",
            "Be holy - 1 Peter 1:16, Romans 12:1. 1 Peter 1:15.",
            "Be obedient - 2 Corinthians 10:5-6. Disobedience is witchcraft - 1 Samuel 15:23.",
            "Live by faith - Hebrews 11:6.",
            "Position yourself, as Zacchaeus did - Luke 19:4-8.",
            "Ask to be partaker - Matthew 7:7, Psalm 50:15, Jeremiah 33:3"
        ]
    ],
    "conclusion": "Unless Jesus Christ reveals Himself to you as Wonderful, you cannot access the surprise packages in His kitty that can truly overwhelm you. Ask Him to reveal Himself to you as Wonderful.",
    "questions": [
        "In what ways is Jesus Christ wonderful?",
        "How do you partake of His wonderful nature?"
    ],
    "blessedWeek": [
        "John 4-14 - Let us thirst for eternal life in Christ Jesus only.",
        "Mark 10:21 - We must not let our possessions or money keep us from following Jesus.",
        "John 11:35 - Jesus cares enough for us to weep with us in our sorrows.",
        "Matthew 14:23 - Spending time alone with God will make you grow spiritually and becomes like Jesus.",
        "Isaiah 35:8-9 God does not simply point the way. He is besides us a",
        "Ephesians 1:11 - God's purpose to save you cannot be frustrated, no matter what evil Satan may bring.",
        "Ephesians 1:5 - The plan of God has always been to adopt us. Are you in this loving relationship with Him?"
    ]
}